; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	infrared4 - mode
	image1 - mode
	infrared2 - mode
	thermograph0 - mode
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star11 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star9 - direction
	Star2 - direction
	GroundStation0 - direction
	Star10 - direction
	Star7 - direction
	GroundStation8 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star9)
	(supports instrument2 image3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph0)
	(supports instrument3 image3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared4)
	(supports instrument4 image1)
	(calibration_target instrument4 Star7)
	(supports instrument5 image3)
	(supports instrument5 infrared4)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation8)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Star12 thermograph0)
	(have_image Planet13 infrared4)
	(have_image Planet14 infrared4)
	(have_image Planet15 thermograph0)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 5
2. (calibrate satellite1 instrument4 star7)
   added: (calibrated instrument4)
   goals met: 0 of 5
3. (turn_to satellite1 planet13 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet13)
   goals met: 0 of 5
4. (take_image satellite1 planet13 instrument4 infrared4)
   added: (have_image planet13 infrared4)
   goals met: 1 of 5
5. (turn_to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 1 of 5
6. (take_image satellite1 planet14 instrument4 infrared4)
   added: (have_image planet14 infrared4)
   goals met: 2 of 5
7. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 2 of 5
8. (take_image satellite1 planet15 instrument4 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 3 of 5
9. (turn_to satellite1 star12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star12)
   goals met: 3 of 5
10. (take_image satellite1 star12 instrument4 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 4 of 5
11. (turn_to satellite0 groundstation3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation3)
   goals met: 5 of 5
